Tekla Open API Reference for Tekla Structures 2025
LinkAttributes Properties
The LinkAttributes type exposes the following members.
Properties
Name | Description
Font
 Gets or sets the font attributes.
Frame
 Gets or sets the link frame attributes.
IsUnderlined
 Defines whether the link is underlined or not.
Scaling
 Gets or sets the link scaling options.
Top
See Also
Reference
LinkAttributes Class
Tekla.Structures.Drawing Namespace